{
    "name": "01-casa_tomada-julio_cortazar",
    "type": "dir",
    "lesson": true,
    "description": "Aprende a moverte entre ficheros y ver sus contenidos.",
    "contents": [{
        "name": "README",
        "type": "text",
        "description": "Instrucciones para esta lección.",
        "contents": "¡Bienvenido a la primera lección!<br /><br />Aquí aprenderás a moverte entre carpetas y a ver el contenido de los archivos desde la terminal al mismo tiempo que lees el cuento «Casa tomada» de Julio Cortázar.<br /><br />Para este cometido tres comandos serán nuestros principales aliados: «cat», «cd» y «ls». ¡Esto no implica que no puedas probar con el resto de los comandos!<br /><br />---<br /><br />Dinámica:<br /><br />Entra y muévete a través de la casa. El cuento está fragmentado en 15 partes distribuidas entre las habitaciones. La historia puedes learla en el orden que desees, pero únicamente progresará conforme hayas leído la cantidad de bloques requeridos (descubre los distintos puntos en donde el cuento avanza).<br /><br />---<br /><br />Explicación del uso:<br /><br />Lee el contenido de «explicacion.txt» («<a href=\"javascript:void(0)\" onclick=\"typeCommand('cat ~/01-casa_tomada-julio_cortazar/explicacion.txt')\">cat explicacion.txt</a>»)<br /><br />---<br /><br />Tips:<br /><br />-Utiliza la tecla Tab para autocompletar el nombre de los ficheros y que así no tengas que escribirlo todo. Si el autocompletar no funciona, es probable que el fichero no exista o que lo hayas escrito de manera incorrecta.<br />-Usa los otros comandos, especialmente «tree». Para saber cuáles están disponibles, escribe «<a href=\"javascript:void(0)\" onclick=\"typeCommand('help')\">help</a>» o presiona en el botón de ayuda ubicado en la parte superior derecha."
    },{
        "name": "explicacion.txt",
        "type": "text",
        "description": "Instrucciones para esta lección.",
        "contents": "El comando «cat» sirve para mostrar el contenido de los archivos. Este comando es muy útil si deseas leer el texto que contiene algún archivo.<br /><br />Uso: «cat ruta/del/archivo», donde «ruta/del/archivo» puede ser el nombre de algún archivo que está presente en el directorio actual (ruta relativa) o el nombre del archivo junto con todas las carpetas que le anteceden hasta el directorio de inicio (en inglés <i>home directory</i>) que en la terminal se abrevia como «~». Por ejemplo, para leer este archivo puedes usar «<a href=\"javascript:void(0)\" onclick=\"typeCommand('cat explicacion.txt')\">cat explicacion.txt</a>», si es que te encuentras en la carpeta «01-casa_tomada-julio_cortazar», o «<a href=\"javascript:void(0)\" onclick=\"typeCommand('cat ~/01-casa_tomada-julio_cortazar/explicacion.txt')\">cat ~/01-casa_tomada-julio_cortazar/explicacion.txt</a>», ¡pruébalo!. En el último caso estamos indicando una ruta absoluta donde le decimos a la terminal que queremos ver («cat») el contenido de un archivo llamado «explicacion.txt», el cual está ubicado en el directorio de inicio («~»), dentro de un subderectorio denominado «01-casa_tomada-julio_cortazar», en donde cada división utiliza una diagonal en lugar de un espacio como estamos acostumbrados en el lenguaje ordinario.<br /><br />---<br /><br />El comando «cd» te ayuda a cambiar de directorio. Este comando es fundamental para poder entrar o salir de carpetas y así tener una nueva ubicación.<br /><br />Uso: «cd ruta/del/directorio», donde de nueva cuenta puedes utilizar rutas relativas o absolutas. Por ejemplo, para entrar a la casa puedes escribir «<a href=\"javascript:void(0)\" onclick=\"typeCommand('cd ~/01-casa_tomada-julio_cortazar/puerta_cancel')\">cd ~/01-casa_tomada-julio_cortazar/puerta_cancel</a>» o «<a href=\"javascript:void(0)\" onclick=\"typeCommand('cd puerta_cancel')\">cd puerta_cancel</a>» si es que ya te encuentras en la carpeta «01-casa_tomada-julio_cortazar».<br /><br />Una vez que ingreses a un nuevo directorio, este quedará indicado en todo el texto antes del símbolo «$», también llamado «prompt».<br /><br />---<br /><br />El comando «ls» muestra una lista con todos los ficheros que contiene la carpeta indicada. Esto es muy ventajoso cuando hemos entrado a una carpeta y no recordamos bien o ignoramos lo que contiene.<br /><br />Uso: «ls ruta/del/directorio», donde de nueva cuenta puedes utilizar rutas relativas o absolutas. Por ejemplo, para una lista compacta del contenido de la entrada de la casa puedes usar «<a href=\"javascript:void(0)\" onclick=\"typeCommand('ls ~/01-casa_tomada-julio_cortazar/puerta_cancel')\">ls ~/01-casa_tomada-julio_cortazar/puerta_cancel</a>» o «<a href=\"javascript:void(0)\" onclick=\"typeCommand('ls puerta_cancel')\">ls puerta_cancel</a>» si es que ya te encuentras en la carpeta «01-casa_tomada-julio_cortazar». Para ver el contenido del direcotorio actual no existe la necesidad de especificar la ruta al directorio, sino solo escribir «ls», pruébalo para que veas qué contiene la carpeta en donde ahora te encuentras.<br /><br />El comando «ls» tiene dos argumentos adicionales que son «-a» y «-l». El <i>flag</i> «-a» quiere decir «<i>all</i>», el cual muestra todos los ficheros, incluyendo los ocultos; además, al inicio imprime un punto, que indica el mismo directorio señalado, y después dos puntos, que señala la carpeta anterior. Por ejemplo, si estamos en «01-casa_tomada-julio_cortazar» y escribimos «ls -a» el punto es igual a «01-casa_tomada-julio_cortazar» y los dos puntos, al directorio de inicio. El segundo argumento es el <i>flag</i> «-l» que quiere decir «<i>long</i>», el cual despliega una lista extendida, donde cada elemento se mostrará en una nueva línea. Estos dos argumentos pueden colocarse en cualquier lugar después de «ls» y pueden utilizarse de manera conjunta, sea de manera separada («<a href=\"javascript:void(0)\" onclick=\"typeCommand('ls -a -l')\">ls -a -l</a>») o unidas («<a href=\"javascript:void(0)\" onclick=\"typeCommand('ls -la')\">ls -la</a>» o «<a href=\"javascript:void(0)\" onclick=\"typeCommand('ls -al')\">ls -al</a>») ¡No olvides separar con un espacio los <i>flags</i> del comando y la ruta al directorio; los espacios es la manera en como la terminal puede distinguir uno de otro!<br /><br />---<br /><br />FAQ:<br /><br />-¿Qué es el directorio de inicio?<br />Es la carpeta principal de un usuario, la cual contiene todos sus archivos, cuya abreviatura es «~».<br /><br />-¿Qué es el «prompt»?<br />Te recomendamos leer <a href=\"https://es.wikipedia.org/wiki/Prompt\" target=\"_blank\">este artículo de la Wikipedia (haz clic)</a>». El prompt de CLIteratura se compone de los siguientes elementos: «[usuario]@[máquina]:[ubicación actual]$» donde «[usuario]» es «leyente» por defecto, «[máquina]» es «cliteratura» y «[ubicación actual]» es la ruta absoluta de la carpeta en donde te encuentras actualmente.<br /><br />-¿Qué es un <i>flag</i>?<br />Los <i>flags</i> son las opciones, también llamadas llaves, de un comando, el cual permite cierta personalización al momento de ejecutarlo. El caso de «ls» tiene una gran variedad de <i>flags</i>, pero en CLIteratura solo se implementaron los dos más populares.<br /><br />-¿Qué son los ficheros ocultos?<br />Son los archivos y carpetas que no se muestran al menos que se indiquen expresamente. Los ficheros ocultos siempre comienza su nombre con un punto, por ejemplo, «.carpeta_oculta» o «.archivo_oculto.txt». La ocultación de archivos se lleva a cabo cuando se requiere guardar información cuya utilidad no es perceptible para el usuario promedio, pero que sin embargo es importante para la ejecución de algún programa o cuando solo se desea que un fichero pase por alto para el usuario regular.<br /><br />-Qué pasa si con «cat», «cd» o «ls» intento acceder a un fichero inexistente, cuyo nombre escribí mal, cuya ruta es incorrecta o que no tengo permiso de acceso?<br />¡Nada! En cada caso la terminal te indicará el motivo por el que no se pudo ejecutar el comando.<br /><br />-¿Cómo le hago para regresar a un fichero anterior con «cd»?<br />Para ir a una carpeta anterior, existe la posibilidad de utilizar puntos suspensivos. Por ejemplo, si nos encontramos en la entrada de la casa («~/01-casa_tomada-julio_cortazar/puerta_cancel») y deseamos regresar a la carpeta de esta lección («~/01-casa_tomada-julio_cortazar»), puedes escribir solamente «cd ..»; o bien, si desde la entrada de la casa deseas regresar al direcotorio de inicio («~»), puedes usar «cd ../..» para así ir a «01-casa_tomada-julio_cortazar» y de ahí a «~», o aún más fácil, para regresar desde cualquier lugar al directorio de inicio puedes únicamente escribir «cd»."
    },{
        "name": ".sabias_que.txt",
        "type": "text",
        "description": "Curiosidades de Julio Cortázar.",
        "contents": "Estas son algunas curiosidades de Julio Cortázar:<br />-<i>Casa tomada</i> se considera su primera publicación, la cual apareció en 1946 en la revista <i>Los Anales de Buenos Aires</i>, dirigida por Jorge Luis Borges.<br />-Era un reconocido traductor, en donde destacan los más de sesenta cuentos de Edgar Allan Poe que tradujo.<br />-Le gustaba implementar elementos lúdicos en sus escritos.<br />-Era fanático del boxeo y del <i>jazz</i>.<br />-No podía pronunciar la «r» del castellano, lo hacía como la «r» gutural francesa.<br />-Era alérgico al ajo.<br />-Murió de leucemia, aunque algunos sostienen que murió de sida.<br /><br />---<br /><br />Fuentes:<br /><a href=\"http://culturacolectiva.com/mas-de-60-cuentos-de-edgar-allan-poe-traducidos-por-cortazar/\" target=\"_blank\">http://culturacolectiva.com/mas-de-60-cuentos-de-edgar-allan-poe-traducidos-por-cortazar/</a><br /><a href=\"http://edant.clarin.com/diario/2001/06/07/s-04001.htm\" target=\"_blank\">http://edant.clarin.com/diario/2001/06/07/s-04001.htm</a><br /><a href=\"https://es.wikipedia.org/wiki/Julio_Cort%C3%A1zar\" target=\"_blank\">https://es.wikipedia.org/wiki/Julio_Cort%C3%A1zar</a><br /><a href=\"http://www.estandarte.com/noticias/autores/julio-cortazar-cumple-cien-anos-diez-curiosidades_2654.html\" target=\"_blank\">http://www.estandarte.com/noticias/autores/julio-cortazar-cumple-cien-anos-diez-curiosidades_2654.html</a><br /><a href=\"http://www.sexenio.com.mx/articulo.php?id=7960\" target=\"_blank\">http://www.sexenio.com.mx/articulo.php?id=7960</a>"
    },{
        "name": "julio_cortazar.jpg",
        "type": "img",
        "description": "Fotografía de Julio Cortázar.",
        "contents": "/img/01-julio_cortazar.jpg",
        "caption" : "Fuente: <a href=\"https://es.wikipedia.org/wiki/Julio_Cort%C3%A1zar\" target=\"_blank\">Wikipedia</a>."
    },{
        "name": "ciudad_seva",
        "type": "exec",
        "description": "Accede al texto de origen de esta lección.",
        "contents": "http://ciudadseva.com/texto/casa-tomada/"
    },{
        "name": "puerta_cancel",
        "type": "dir",
        "description": "La entrada de nuestra casa, un zaguán con una puerta cancel.",
        "contents": [{
            "name": "01-inicio.txt",
            "type": "text",
            "track": 1,
            "description": "Nos gustaba la casa…",
            "contents": "Nos gustaba la casa porque aparte de espaciosa y antigua (hoy que las casas antiguas sucumben a la más ventajosa liquidación de sus materiales) guardaba los recuerdos de nuestros bisabuelos, el abuelo paterno, nuestros padres y toda la infancia."
        },{
            "name": "14-cosas_perdidas.txt",
            "type": "text",
            "visible": false,
            "permission": false,
            "track": 1,
            "description": "Han tomado esta parte…",
            "contents": "—Han tomado esta parte —dijo Irene. El tejido le colgaba de las manos y las hebras iban hasta la cancel y se perdían debajo. Cuando vio que los ovillos habían quedado del otro lado, soltó el tejido sin mirarlo.<br /><br />—¿Tuviste tiempo de traer alguna cosa? —le pregunté inútilmente.<br /><br />—No, nada.<br /><br />Estábamos con lo puesto. Me acordé de los quince mil pesos en el armario de mi dormitorio. Ya era tarde ahora."
        },{
            "name": "15-fin.txt",
            "type": "text",
            "visible": false,
            "permission": false,
            "track": 1,
            "description": "Como me quedaba el reloj pulsera…",
            "contents": "Como me quedaba el reloj pulsera, vi que eran las once de la noche. Rodeé con mi brazo la cintura de Irene (yo creo que ella estaba llorando) y salimos así a la calle. Antes de alejarnos tuve lástima, cerré bien la puerta de entrada y tiré la llave a la alcantarilla. No fuese que a algún pobre diablo se le ocurriera robar y se metiera en la casa, a esa hora y con la casa tomada."
        },{
            "name": "living",
            "type": "dir",
            "description": "Un living central que comunica todas las partes de la casa.",
            "contents": [{
                "name": "11-casa_irene_y_yo.txt",
                "type": "text",
                "visible": false,
                "permission": false,
                "track": 1,
                "description": "Cuando Irene soñaba…",
                "contents": "(Cuando Irene soñaba en alta voz yo me desvelaba en seguida. Nunca pude habituarme a esa voz de estatua o papagayo, voz que viene de los sueños y no de la garganta. Irene decía que mis sueños consistían en grandes sacudones que a veces hacían caer el cobertor. Nuestros dormitorios tenían el living de por medio, pero de noche se escuchaba cualquier cosa en la casa. Nos oíamos respirar, toser, presentíamos el ademán que conduce a la llave del velador, los mutuos y frecuentes insomnios.<br /><br />Aparte de eso todo estaba callado en la casa. De día eran los rumores domésticos, el roce metálico de las agujas de tejer, un crujido al pasar las hojas del álbum filatélico. La puerta de roble, creo haberlo dicho, era maciza. En la cocina y el baño, que quedaban tocando la parte tomada, nos poníamos a hablar en voz más alta o Irene cantaba canciones de cuna. En una cocina hay demasiados ruidos de loza y vidrios para que otros sonidos irrumpan en ella. Muy pocas veces permitíamos allí el silencio, pero cuando tornábamos a los dormitorios y al living, entonces la casa se ponía callada y a media luz, hasta pisábamos despacio para no molestarnos. Yo creo que era por eso que de noche, cuando Irene empezaba a soñar en alta voz, me desvelaba en seguida.)"
            },{
                "name": "13-puerta_cancel.txt",
                "type": "text",
                "visible": false,
                "permission": false,
                "track": 1,
                "description": "No nos miramos siquiera…",
                "contents": "No nos miramos siquiera. Apreté el brazo de Irene y la hice correr conmigo hasta la puerta cancel, sin volvernos hacia atrás. Los ruidos se oían más fuerte pero siempre sordos, a espaldas nuestras. Cerré de un golpe la cancel y nos quedamos en el zaguán. Ahora no se oía nada."
            },{
                "name": "dormitorio_irene",
                "type": "dir",
                "description": "El dormitorio de Irene que cuenta con un sofá y una mesa.",
                "contents": [{
                    "name": "10-irene_y_yo.txt",
                    "type": "text",
                    "visible": false,
                    "permission": false,
                    "track": 1,
                    "description": "Irene estaba contenta…",
                    "contents": "Irene estaba contenta porque le quedaba más tiempo para tejer. Yo andaba un poco perdido a causa de los libros, pero por no afligir a mi hermana me puse a revisar la colección de estampillas de papá, y eso me sirvió para matar el tiempo. Nos divertíamos mucho, cada uno en sus cosas, casi siempre reunidos en el dormitorio de Irene que era más cómodo. A veces Irene decía:<br /><br />—Fijate este punto que se me ha ocurrido. ¿No da un dibujo de trébol?<br /><br />Un rato después era yo el que le ponía ante los ojos un cuadradito de papel para que viese el mérito de algún sello de Eupen y Malmédy. Estábamos bien, y poco a poco empezábamos a no pensar. Se puede vivir sin pensar."
                }]
            },{
                "name": "mi_dormitorio",
                "type": "dir",
                "description": "Mi dormitorio que tiene un armario con algo muy valioso.",
                "contents": [{
                    "name": "08-cosas_perdidas.txt",
                    "type": "text",
                    "visible": false,
                    "permission": false,
                    "track": 1,
                    "description": "Los primeros días…",
                    "contents": "Los primeros días nos pareció penoso porque ambos habíamos dejado en la parte tomada muchas cosas que queríamos. Mis libros de literatura francesa, por ejemplo, estaban todos en la biblioteca. Irene pensó en una botella de Hesperidina de muchos años. Con frecuencia (pero esto solamente sucedió los primeros días) cerrábamos algún cajón de las cómodas y nos mirábamos con tristeza.<br /><br />—No está aquí.<br /><br />Y era una cosa más de todo lo que habíamos perdido al otro lado de la casa."
                }]
            },{
                "name": "pasillo_estrecho",
                "type": "dir",
                "description": "Un camino a la izquierda, antes de la puerta de roble, para ir al baño y a la cocina.",
                "contents": [{
                    "name": "07-toma_fondo.txt",
                    "type": "text",
                    "visible": false,
                    "permission": false,
                    "track": 1,
                    "description": "Fui a la cocina…",
                    "contents": "Fui a la cocina, calenté la pavita, y cuando estuve de vuelta con la bandeja del mate le dije a Irene:<br /><br />—Tuve que cerrar la puerta del pasillo. Han tomado parte del fondo.<br /><br />Dejó caer el tejido y me miró con sus graves ojos cansados.<br /><br />—¿Estás seguro?<br /><br />Asentí.<br /><br />—Entonces —dijo recogiendo las agujas— tendremos que vivir en este lado.<br /><br />Yo cebaba el mate con mucho cuidado, pero ella tardó un rato en reanudar su labor. Me acuerdo que me tejía un chaleco gris; a mí me gustaba ese chaleco."
                },{
                    "name": "bano",
                    "type": "dir",
                    "description": "Un baño.",
                    "contents": []
                },{
                    "name": "cocina",
                    "type": "dir",
                    "description": "Nuestra fuente de comida fiambre y mate.",
                    "contents": [{
                        "name": "09-ventajas.txt",
                        "type": "text",
                        "visible": false,
                        "permission": false,
                        "track": 1,
                        "description": "Pero también tuvimos ventajas…",
                        "contents": "Pero también tuvimos ventajas. La limpieza se simplificó tanto que aun levantándose tardísimo, a las nueve y media por ejemplo, no daban las once y ya estábamos de brazos cruzados. Irene se acostumbró a ir conmigo a la cocina y ayudarme a preparar el almuerzo. Lo pensamos bien, y se decidió esto: mientras yo preparaba el almuerzo, Irene cocinaría platos para comer fríos de noche. Nos alegramos porque siempre resultaba molesto tener que abandonar los dormitorios al atardecer y ponerse a cocinar. Ahora nos bastaba con la mesa en el dormitorio de Irene y las fuentes de comida fiambre."
                    }]
                }]
            },{
                "name": "puerta_roble",
                "type": "dir",
                "description": "Un pasillo con una maciza puerta de roble que divide la casa en dos partes.",
                "contents": [{
                    "name": "06-puerta_roble.txt",
                    "type": "text",
                    "visible": false,
                    "permission": false,
                    "track": 1,
                    "description": "Lo recordaré siempre…",
                    "contents": "Lo recordaré siempre con claridad porque fue simple y sin circunstancias inútiles. Irene estaba tejiendo en su dormitorio, eran las ocho de la noche y de repente se me ocurrió poner al fuego la pavita del mate. Fui por el pasillo hasta enfrentar la entornada puerta de roble, y daba la vuelta al codo que llevaba a la cocina cuando escuché algo en el comedor o en la biblioteca. El sonido venía impreciso y sordo, como un volcarse de silla sobre la alfombra o un ahogado susurro de conversación. También lo oí, al mismo tiempo o un segundo después, en el fondo del pasillo que traía desde aquellas piezas hasta la puerta. Me tiré contra la pared antes de que fuera demasiado tarde, la cerré de golpe apoyando el cuerpo; felizmente la llave estaba puesta de nuestro lado y además corrí el gran cerrojo para más seguridad."
                },{
                    "name": "12-puerta_roble.txt",
                    "type": "text",
                    "visible": false,
                    "permission": false,
                    "track": 1,
                    "description": "Es casi repetir lo mismo…",
                    "contents": "Es casi repetir lo mismo salvo las consecuencias. De noche siento sed, y antes de acostarnos le dije a Irene que iba hasta la cocina a servirme un vaso de agua. Desde la puerta del dormitorio (ella tejía) oí ruido en la cocina; tal vez en la cocina o tal vez en el baño porque el codo del pasillo apagaba el sonido. A Irene le llamó la atención mi brusca manera de detenerme, y vino a mi lado sin decir palabra. Nos quedamos escuchando los ruidos, notando claramente que eran de este lado de la puerta de roble, en la cocina y el baño, o en el pasillo mismo donde empezaba el codo casi al lado nuestro."
                },{
                    "name": "biblioteca",
                    "type": "dir",
                    "description": "El lugar donde guardo mis libros de literatura francesa.",
                    "contents": [{
                        "name": "03-irene.txt",
                        "type": "text",
                        "track": 1,
                        "description": "Irene era una chica..",
                        "contents": "Irene era una chica nacida para no molestar a nadie. Aparte de su actividad matinal se pasaba el resto del día tejiendo en el sofá de su dormitorio. No sé por qué tejía tanto, yo creo que las mujeres tejen cuando han encontrado en esa labor el gran pretexto para no hacer nada. Irene no era así, tejía cosas siempre necesarias, tricotas para el invierno, medias para mí, mañanitas y chalecos para ella. A veces tejía un chaleco y después lo destejía en un momento porque algo no le agradaba; era gracioso ver en la canastilla el montón de lana encrespada resistiéndose a perder su forma de algunas horas. Los sábados iba yo al centro a comprarle lana; Irene tenía fe en mi gusto, se complacía con los colores y nunca tuve que devolver madejas. Yo aprovechaba esas salidas para dar una vuelta por las librerías y preguntar vanamente si había novedades en literatura francesa. Desde 1939 no llegaba nada valioso a la Argentina."
                    }]
                },{
                    "name": "comedor",
                    "type": "dir",
                    "description": "Un amplio comedor donde hay una botella de Hesperidina.",
                    "contents": [{
                        "name": "04-casa_e_irene.txt",
                        "type": "text",
                        "track": 1,
                        "description": "Pero es de la casa…",
                        "contents": "Pero es de la casa que me interesa hablar, de la casa y de Irene, porque yo no tengo importancia. Me pregunto qué hubiera hecho Irene sin el tejido. Uno puede releer un libro, pero cuando un pullover está terminado no se puede repetirlo sin escándalo. Un día encontré el cajón de abajo de la cómoda de alcanfor lleno de pañoletas blancas, verdes, lila. Estaban con naftalina, apiladas como en una mercería; no tuve valor para preguntarle a Irene qué pensaba hacer con ellas. No necesitábamos ganarnos la vida, todos los meses llegaba plata de los campos y el dinero aumentaba. Pero a Irene solamente la entretenía el tejido, mostraba una destreza maravillosa y a mí se me iban las horas viéndole las manos como erizos plateados, agujas yendo y viniendo y una o dos canastillas en el suelo donde se agitaban constantemente los ovillos. Era hermoso."
                    }]
                },{
                    "name": "dormitorio_1",
                    "type": "dir",
                    "description": "Un gran dormitorio que guarda recuerdos de nuestros ancestros e infancia.",
                    "contents": []
                },{
                    "name": "dormitorio_2",
                    "type": "dir",
                    "description": "Un gran dormitorio que guarda recuerdos de nuestros ancestros e infancia.",
                    "contents": []
                },{
                    "name": "dormitorio_3",
                    "type": "dir",
                    "description": "Un gran dormitorio que guarda recuerdos de nuestros ancestros e infancia.",
                    "contents": [{
                        "name": "02-irene_y_yo.txt",
                        "type": "text",
                        "track": 1,
                        "description": "Nos habituamos Irene y yo…",
                        "contents": "Nos habituamos Irene y yo a persistir solos en ella, lo que era una locura pues en esa casa podían vivir ocho personas sin estorbarse. Hacíamos la limpieza por la mañana, levantándonos a las siete, y a eso de las once yo le dejaba a Irene las últimas habitaciones por repasar y me iba a la cocina. Almorzábamos al mediodía, siempre puntuales; ya no quedaba nada por hacer fuera de unos platos sucios. Nos resultaba grato almorzar pensando en la casa profunda y silenciosa y cómo nos bastábamos para mantenerla limpia. A veces llegábamos a creer que era ella la que no nos dejó casarnos. Irene rechazó dos pretendientes sin mayor motivo, a mí se me murió María Esther antes que llegáramos a comprometernos. Entramos en los cuarenta años con la inexpresada idea de que el nuestro, simple y silencioso matrimonio de hermanos, era necesaria clausura de la genealogía asentada por nuestros bisabuelos en nuestra casa. Nos moriríamos allí algún día, vagos y esquivos primos se quedarían con la casa y la echarían al suelo para enriquecerse con el terreno y los ladrillos; o mejor, nosotros mismos la voltearíamos justicieramente antes de que fuese demasiado tarde."
                    }]
                },{
                    "name": "sala",
                    "type": "dir",
                    "description": "Una sala con gobelinos.",
                    "contents": [{
                        "name": "05-distribucion_casa.txt",
                        "type": "text",
                        "track": 1,
                        "description": "Cómo no acordarme…",
                        "contents": "Cómo no acordarme de la distribución de la casa. El comedor, una sala con gobelinos, la biblioteca y tres dormitorios grandes quedaban en la parte más retirada, la que mira hacia Rodríguez Peña. Solamente un pasillo con su maciza puerta de roble aislaba esa parte del ala delantera donde había un baño, la cocina, nuestros dormitorios y el living central, al cual comunicaban los dormitorios y el pasillo. Se entraba a la casa por un zaguán con mayólica, y la puerta cancel daba al living. De manera que uno entraba por el zaguán, abría la cancel y pasaba al living; tenía a los lados las puertas de nuestros dormitorios, y al frente el pasillo que conducía a la parte más retirada; avanzando por el pasillo se franqueaba la puerta de roble y mas allá empezaba el otro lado de la casa, o bien se podía girar a la izquierda justamente antes de la puerta y seguir por un pasillo más estrecho que llevaba a la cocina y el baño. Cuando la puerta estaba abierta advertía uno que la casa era muy grande; si no, daba la impresión de un departamento de los que se edifican ahora, apenas para moverse; Irene y yo vivíamos siempre en esta parte de la casa, casi nunca íbamos más allá de la puerta de roble, salvo para hacer la limpieza, pues es increíble cómo se junta tierra en los muebles. Buenos Aires será una ciudad limpia, pero eso lo debe a sus habitantes y no a otra cosa. Hay demasiada tierra en el aire, apenas sopla una ráfaga se palpa el polvo en los mármoles de las consolas y entre los rombos de las carpetas de macramé; da trabajo sacarlo bien con plumero, vuela y se suspende en el aire, un momento después se deposita de nuevo en los muebles y los pianos."
                    }]
                }]
            }]
        }]
    }]
}
